# Регулярное выражение для валидации <username> пользователя
USER_NAME_REG = r'^[\w.@+-]+\Z'

# Максимальная длина <email> пользователя
USER_MAX_LEN_EMAIL = 254

# Максимальная длина <имени> пользователя
USER_MAX_LEN_FIRST_NAME = 254

# Максимальная длина <username> пользователя
USER_MAX_LEN_USERNAME = 150

# Максимальная длина <фамилии> пользователя
USER_MAX_LEN_LAST_NAME = 150

# Минимальное <количество> ингредиента в рецепте
INGREDIENT_MIN_AMOUNT = 1

# Маскимальная длина <названия> у ингредиента
INGREDIENT_MAX_NAME = 200

# Маскимальная длина названия <единиц измерения> ингредиента
INGREDIENT_MAX_NAME_UNIT = 200

# Маскимальная длина <названия> рецепта
RECIPE_MAX_NAME = 200

# Маскимальная длина <описания> рецепта
RECIPE_MAX_TEXT = 1000

# Минимальное <время приготовления> рецепта
RECIPE_MIN_TIME = 1000

# Маскимальная длина <названия> тега
TAG_MAX_NAME = 200

# Максимальная длина <цветности> тега
TAG_MAX_LEN_COLOR_NAME = 7

# Максимальная длина <slug> тега
TAG_MAX_LEN_SLUG_NAME = 200
